RhinoInside.Revit API Documentation
GeometryEncoder.ToXYZ Method
Overload List
Name | Description
ToXYZ(Point3d)
 Converts the specified Rhino.Geometry.Point3d to an equivalent Autodesk.Revit.DB.XYZ.
ToXYZ(Point3f)
 Converts the specified Rhino.Geometry.Point3f to an equivalent Autodesk.Revit.DB.XYZ.
ToXYZ(Vector3d)
 Converts the specified Rhino.Geometry.Vector3d to an equivalent Autodesk.Revit.DB.XYZ.
ToXYZ(Vector3f)
 Converts the specified Rhino.Geometry.Vector3f to an equivalent Autodesk.Revit.DB.XYZ.
Top
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace